In [1]:
import numpy as np

In [17]:
a = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])

In [11]:
#행렬 펼치기

In [18]:
a.flatten()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12])

In [20]:
a.reshape(1,-1)

array([[ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12]])

In [ ]:
# 두 행렬 더하기

In [3]:
matrix_a=np.array([[1,1,1],[1,1,1],[1,1,2]])

In [4]:
matrix_b=np.array([[1,3,1],[1,3,1],[1,3,8]])

In [26]:
np.add(matrix_a,matrix_b)

array([[ 2,  4,  2],
       [ 2,  4,  2],
       [ 2,  4, 10]])

In [29]:
matrix_a+matrix_b

array([[ 2,  4,  2],
       [ 2,  4,  2],
       [ 2,  4, 10]])

In [27]:
#두 행렬 뺴기

In [28]:
np.subtract(matrix_a,matrix_b)

array([[ 0, -2,  0],
       [ 0, -2,  0],
       [ 0, -2, -6]])

In [5]:
np.dot(matrix_a,matrix_b) # 두 행렬 곱하기

array([[ 3,  9, 10],
       [ 3,  9, 10],
       [ 4, 12, 18]])

In [6]:
matrix_a @ matrix_b

array([[ 3,  9, 10],
       [ 3,  9, 10],
       [ 4, 12, 18]])

In [10]:
import pandas as pd

In [11]:
url='https://tinyurl.com/titanic-csv'

In [13]:
dataframe=pd.read_csv(url)

In [14]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

# 데이터프레임 만들기

In [15]:
import pandas as pd

In [16]:
dataframe=pd.DataFrame()

In [ ]:
#1

In [18]:
dataframe['Name']=['Jacky Jackson','Steven Stevenson']

In [19]:
dataframe['Age']=[38,25]

In [20]:
dataframe['Driver']=[True,False]

In [21]:
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [23]:
new_person=pd.Series(['Molly Mooney',40,True],index=['Name','Age','Driver'])

In [24]:
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [25]:
#2

In [26]:
data=[['Jacky Jackson',38, True],['Steven Stevenson',25, False]]

In [27]:
matrix=np.array(data)

In [28]:
pd.DataFrame(matrix, columns=['Name','Age','Driver'])

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [29]:
pd.DataFrame(data,columns=['Name','Age','Driver'])

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

# 3.2데이터 설명하기

In [30]:
import pandas as pd

In [31]:
url='https://tinyurl.com/titanic-csv'

In [32]:
dataframe=pd.read_csv(url)

In [33]:
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [35]:
dataframe.shape

(1313, 6)

In [37]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

# 3.3 데이터프레임 탐색하기

In [38]:
import pandas as pd

In [39]:
url='https://tinyurl.com/titanic-csv'
dataframe=pd.read_csv(url)

In [41]:
dataframe.iloc[0]  #첫번쨰 행 선택

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [42]:
dataframe.iloc[1:4] # 세 개의 행을 선택

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [43]:
dataframe.iloc[:4] # 네개의 행을 선택

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [46]:
dataframe=dataframe.set_index(dataframe['Name']) # 인덱스를 설정

In [47]:
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [48]:
dataframe[:'Allen, Miss Elisabeth Walton']

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1

In [51]:
dataframe[['Age','Sex','SexCode']].head(2)

                               Age     Sex  SexCode
Name
Allen, Miss Elisabeth Walton  29.0  female        1
Allison, Miss Helen Loraine    2.0  female        1

# 3.4 조건에 따라 행 선택하기

In [58]:
url='https://tinyurl.com/titanic-csv'
dataframe=pd.read_csv(url)

In [53]:
dataframe[dataframe['Sex']=='female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [54]:
dataframe[(dataframe['Sex']=='female') &(dataframe['Age']>=65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

# 3.5 값 치환하기

In [56]:
dataframe['Sex'].replace("female","Woman").head(2)

0    Woman
1    Woman
Name: Sex, dtype: object

In [57]:
dataframe['Sex'].replace(["female","male"],["Woman","man"]).head(2)

0    Woman
1    Woman
Name: Sex, dtype: object

# 3.7 최소값, 최대값, 합, 평균 계산개수 세기

In [60]:
print('최대값:',dataframe['Age'].max())
print('최소값:',dataframe['Age'].min())
print('평균:',dataframe['Age'].mean())
print('합:',dataframe['Age'].sum())
print('카운트:',dataframe['Age'].count())

최대값: 71.0
최소값: 0.17
평균: 30.397989417989415
합: 22980.88
카운트: 756

In [61]:
dataframe['Age'].count()

756

In [62]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [63]:
dataframe.cov()

                 Age  Survived   SexCode
Age       203.320470 -0.430491 -0.382054
Survived   -0.430491  0.225437  0.114070
SexCode    -0.382054  0.114070  0.228230

In [64]:
dataframe.corr()

               Age  Survived   SexCode
Age       1.000000 -0.061254 -0.055138
Survived -0.061254  1.000000  0.502891
SexCode  -0.055138  0.502891  1.000000

# 3.8고유값 찾기

In [65]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [67]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [70]:
dataframe['PClass'].nunique() # 고유값의 개수 출력

4

In [73]:
dataframe.nunique() # 데이터프레임 전체에 대한 고유값의 개수 출력

Name        1310
PClass         4
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

 # 3.9 누락된 값 다루기

In [74]:
url='https://tinyurl.com/titanic-csv'
dataframe=pd.read_csv(url)

In [75]:
dataframe['Age'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Name: Age, Length: 1313, dtype: bool

In [77]:
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [78]:
dataframe['Sex']=dataframe['Sex'].replace('male',np.nan)

In [79]:
dataframe['Sex'].nunique()

1